[{"title":"Friends mourn as a cow reportedly k#lls KSU fresh graduate","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2339.jpeg?fit=1038%2C543&ssl=1","text":"Friends and family are currently mourning one Anone Felix who was reportedly k#lled by a cow just days after he graduated from Kogi State University (KSU). Felix went viral last week after photos of him prostrating to thank his father, a motorcyclist, h#t the internet. According to reports, Felix...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/friends-mourn-as-a-cow-reportedly-klls-ksu-fresh-graduate/"},{"title":"“It is not easy living in Nigeria,” Arrested suspects on why they stol£ a human sk¥ll for money rit¥al in Niger State","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2330.jpeg?fit=1038%2C543&ssl=1","text":"Police operatives in Niger State have arrested five suspects have for allegedly being in possession of a human sk¥ll. The suspects have been identified as 26-year-old Isah Mohammed; 28-year-old Idris Mohammed; 18-year-old Ibrahim Jiya; 22-year-old Suleiman Usman and 24-year-old Abdullahi Usman. They were arrested on Monday, September 11, by...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/it-is-not-easy-living-in-nigeria-arrested-suspects-on-why-they-stol-a-human-sk%c2%a5ll-for-money-rit%c2%a5al-in-niger-state/"},{"title":"Nigeria to achieve 20,000 megawatts in 2026 — Minister of Power","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2319.jpeg?fit=1038%2C543&ssl=1","text":"The Minister of Power, Bayo Adelabu, has said the Federal Government is working towards generating 20,000 megawatts of electricity by 2026 and 60,000MW by 2060. Speaking in Osogbo, Osun State on Friday, September 22, the minister said: “Like I told you, it’s an aspiration for Nigeria to have minimum...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/nigeria-to-achieve-20000-megawatts-in-2026-minister-of-power/"},{"title":"Suspect arrested for inj£cting Mohbad is not a nurse — Lagos NANNM","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2267.jpeg?fit=1038%2C543&ssl=1","text":"The National Association of Nigeria Nurses and Midwives (NANNM) Lagos State Council, has said the person reportedly arrested for inj£cting Mohbad is not a registered nurse. The association disclosed this in a press statement signed by the State Secretary, Toba Odumosu, on Saturday, September 23. “The National Association of...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/suspect-arrested-for-injcting-mohbad-is-not-a-nurse-lagos-nannm/"},{"title":"Gov. Sanwo-Olu seen ‘stepping down’ with boli moments after vowing to shun all lawlessness at Lagos-Badagry Expressway.","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2261.jpeg?fit=1038%2C543&ssl=1","text":"The governor of Lagos state, Babajide Sanwoolu was seen yesterday buying roasted plantain around Lagos-Badagry expressway. According to the governor’s SSA on new media, Jubril Gawat, Sanwoolu had a long day and decided to cool off with roasted plantain. This comes after he warned illegal occupants, traders and squatters...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/gov-sanwo-olu-seen-stepping-down-with-boli-moments-after-vowing-to-shun-all-lawlessness-at-lagos-badagry-expressway/"},{"title":"Mohbad’s Candlelight Procession: Police finally explain why they used t£areas to disperse protesters at Lekki, Lagos.","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2243.jpeg?fit=1038%2C543&ssl=1","text":"The Nigerian police has revealed that the reason why they use tear-gas to disperse protesters at the lekki toll gate after the Mohbad candle light procession was because of their reckless and unruly behavior after the event had ended. In a statement made by a top police official, he...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/mohbads-candlelight-procession-police-finally-explain-why-they-used-tareas-to-disperse-protesters-at-lekki-lagos/"},{"title":"I am getting d£ath thr£@ts — Singer Oxlade says, as he explains why he restricted his friend, Mohbad.","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2220.jpeg?fit=1038%2C543&ssl=1","text":"Music star, Oxlade pours out his heart in a lengthy note as he addresses the backlash trailing his leaked tape, lawsuit and restricted DM of late colleague, Mohbad. Addressing the backlash, Oxlade emphasized that his account his managed by record label and the restricted method is how he labels...","date":"September 23, 2023","url":"https://instablog9ja.com/2023/09/23/i-am-getting-dath-thrts-singer-oxlade-says-as-he-explains-why-he-restricted-his-friend-mohbad/"},{"title":"The heartwarming moment singer Bella Shmurda called his bestie, Mohbad, during an interview.  : @korty_EO","img":"https://s.w.org/images/core/emoji/14.0.0/svg/1f3a5.svg","text":"As the tribute keeps pouring in for the late Afrobeats singer, Mohbad, a heartwarming conversation between him and his best friend, Bella Shmurda resurfaces. In the latest video making rounds on social media, the late 27-year-old singer was seen having a chatter with his best friend, Bella Shmurda who...","date":"September 22, 2023","url":"https://instablog9ja.com/2023/09/22/the-heartwarming-moment-singer-bella-shmurda-called-his-bestie-mohbad-during-an-interview-%f0%9f%8e%a5-korty_eo/"},{"title":"DJ Kaywise gifts his girlfriend a bouquet of hard currency on her birthday.","img":"https://i0.wp.com/instablog9ja.com/wp-content/uploads/2023/09/IMG_2217.jpeg?fit=1038%2C543&ssl=1","text":"Popular Music DJ Kaywise has showered his girlfriend with a huge gift as he sent a bouquet decorated with dollar bills on her birthday. The moment was captured in a video as the money bouquet was delivered with a handwritten love note from DJ Kaywise, while his girlfriend couldn’t...","date":"September 22, 2023","url":"https://instablog9ja.com/2023/09/22/dj-kaywise-gifts-his-girlfriend-a-bouquet-of-hard-currency-on-her-birthday/"},{"title":"Some Nigerian artistes now do rit¥als and take oath just to bl%w — Comedian Alibaba  : @channelstelevision.","img":"https://s.w.org/images/core/emoji/14.0.0/svg/1f3a5.svg","text":"Comedian and actor, Akunyota Akpobome aka Alibaba, recently asserted that before being signed by a record label, aspiring artists engage in ‘dark’ practices. ln Channels Television’s  on Friday, September 22, the seasoned entertainer emphasised that talented individuals should never succumb to such pressures, rather, they should steadfastly define their...","date":"September 22, 2023","url":"https://instablog9ja.com/2023/09/22/some-nigerian-artistes-now-do-rit%c2%a5als-and-take-oath-just-to-blw-comedian-alibaba-%f0%9f%8e%a5-channelstelevision/"}]